Soap/gsoap/src/EdlProviderBinding.getEdl.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:fimsdescription="http://description.fims.tv"
  xmlns:fims="http://base.fims.tv"
  xmlns:edlprovider="http://temp/edlprovider">
 <SOAP-ENV:Body>
   <edlprovider:getEdlRequest>
    <edlFramesPerSecond numerator="" denominator="">0</edlFramesPerSecond>
    <edlType></edlType>
    <clips>
     <clips>
      <markIn>
       <fims:timecode></fims:timecode>
       <!-- extensibility element(s) -->

      </markIn>
      <markOut>
       <fims:timecode></fims:timecode>
       <!-- extensibility element(s) -->

      </markOut>
      <clipInfo>
       <fims:bmContents>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <!-- extensibility element(s) -->

         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <!-- extensibility element(s) -->

         </fims:descriptions>
         <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
          <!-- extensibility element(s) -->

         </fims:notifyAt>
         <fims:ExtensionGroup>
          <!-- extensibility element(s) -->

         </fims:ExtensionGroup>
         <fims:ExtensionAttributes></fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
         <!-- extensibility element(s) -->

        </fims:bmContent>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <!-- extensibility element(s) -->

         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <!-- extensibility element(s) -->

         </fims:descriptions>
         <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
          <!-- extensibility element(s) -->

         </fims:notifyAt>
         <fims:ExtensionGroup>
          <!-- extensibility element(s) -->

         </fims:ExtensionGroup>
         <fims:ExtensionAttributes></fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
         <!-- extensibility element(s) -->

        </fims:bmContent>
        <!-- extensibility element(s) -->

       </fims:bmContents>
       <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
       <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
       <fims:notifyAt>
        <fims:replyTo></fims:replyTo>
        <fims:faultTo></fims:faultTo>
        <!-- extensibility element(s) -->

       </fims:notifyAt>
       <fims:ExtensionGroup>


        <!-- extensibility element(s) -->

       </fims:ExtensionGroup>
       <fims:ExtensionAttributes></fims:ExtensionAttributes>
       <fims:resourceID></fims:resourceID>
       <fims:revisionID></fims:revisionID>
       <fims:location></fims:location>
       <!-- extensibility element(s) -->

      </clipInfo>
      <!-- extensibility element(s) -->

     </clips>
     <clips>
      <markIn>
       <fims:timecode></fims:timecode>
       <!-- extensibility element(s) -->

      </markIn>
      <markOut>
       <fims:timecode></fims:timecode>
       <!-- extensibility element(s) -->

      </markOut>
      <clipInfo>
       <fims:bmContents>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <!-- extensibility element(s) -->

         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <!-- extensibility element(s) -->

         </fims:descriptions>
         <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
          <!-- extensibility element(s) -->

         </fims:notifyAt>
         <fims:ExtensionGroup>
          <!-- extensibility element(s) -->

         </fims:ExtensionGroup>
         <fims:ExtensionAttributes></fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
         <!-- extensibility element(s) -->

        </fims:bmContent>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:bmContentFormat>
          <!-- extensibility element(s) -->

         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
           <!-- extensibility element(s) -->

          </fims:description>
          <!-- extensibility element(s) -->

         </fims:descriptions>
         <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
          <!-- extensibility element(s) -->

         </fims:notifyAt>
         <fims:ExtensionGroup>
          <!-- extensibility element(s) -->

         </fims:ExtensionGroup>
         <fims:ExtensionAttributes></fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
         <!-- extensibility element(s) -->

        </fims:bmContent>
        <!-- extensibility element(s) -->

       </fims:bmContents>
       <fims:resourceCreationDate>2014-05-02T18:06:45Z</fims:resourceCreationDate>
       <fims:resourceModifiedDate>2014-05-02T18:06:45Z</fims:resourceModifiedDate>
       <fims:notifyAt>
        <fims:replyTo></fims:replyTo>
        <fims:faultTo></fims:faultTo>
        <!-- extensibility element(s) -->

       </fims:notifyAt>
       <fims:ExtensionGroup>


        <!-- extensibility element(s) -->

       </fims:ExtensionGroup>
       <fims:ExtensionAttributes></fims:ExtensionAttributes>
       <fims:resourceID></fims:resourceID>
       <fims:revisionID></fims:revisionID>
       <fims:location></fims:location>
       <!-- extensibility element(s) -->

      </clipInfo>
      <!-- extensibility element(s) -->

     </clips>
     <!-- extensibility element(s) -->

    </clips>
    <edlSequenceName></edlSequenceName>
    <!-- extensibility element(s) -->

   </edlprovider:getEdlRequest>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
